<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"0339b73913afb56c2b8880bb52354a7f7c613b239f548229bf30649e799c7198","plan_job_ref":"Job .github/workflows/terraform-plan.yml #82 at https://github.com/GradientFlow-ai/terraform/actions/runs/4803494071","plan_hash":"b715586d824dc43142d01be9dd47be00bd9dee6ec3b2bdcf7753e61beb3f8012","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 6 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repos.github_branch_protection.eaas will be updated in-place
  ~ resource "github_branch_protection" "eaas" {
        id                              = "BPR_kwDOI7EyTc4CIwZR"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.embeddings_api will be updated in-place
  ~ resource "github_branch_protection" "embeddings_api" {
        id                              = "BPR_kwDOI-ZWE84CIwg4"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.fast-api-ocean will be updated in-place
  ~ resource "github_branch_protection" "fast-api-ocean" {
        id                              = "BPR_kwDOI96H_s4CIwg3"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.terraform will be updated in-place
  ~ resource "github_branch_protection" "terraform" {
        id                              = "BPR_kwDOJOQLq84CJzKa"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.roles.aws_iam_access_key.vercel_s3_user_key will be created
  + resource "aws_iam_access_key" "vercel_s3_user_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "VercelS3User"
    }

  # module.roles.aws_iam_user.vercel_s3_user will be created
  + resource "aws_iam_user" "vercel_s3_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "VercelS3User"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.roles.aws_iam_user_policy_attachment.vercel_s3_policy_attachment will be created
  + resource "aws_iam_user_policy_attachment" "vercel_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::207932680283:policy/VercelS3Policy"
      + user       = "VercelS3User"
    }

  # module.vercel.vercel_project_environment_variable.AWS_ACCESS_KEY_ID will be updated in-place
  ~ resource "vercel_project_environment_variable" "AWS_ACCESS_KEY_ID" {
        id         = "Xo8A6RTPbEAV7cBo"
      ~ value      = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project_environment_variable.AWS_SECRET_ACCESS_KEY will be updated in-place
  ~ resource "vercel_project_environment_variable" "AWS_SECRET_ACCESS_KEY" {
        id         = "hiOWoeDjUIPwsaUW"
      ~ value      = (sensitive value)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 6 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #43](https://github.com/GradientFlow-ai/terraform/actions/runs/4803508430)